# Series and Dataframe

Series হলো একক কলামের ডাটা স্ট্রাকচার, যা একটি লেবেলযুক্ত ইনডেক্সসহ এক-মাত্রিক (1D) অ্যারে-এর মতো কাজ করে। এটি সংখ্যাসূচক, স্ট্রিং, বা অন্যান্য ধরনের ডাটা রাখতে পারে।

Series-এর বৈশিষ্ট্যঃ

এটি NumPy অ্যারের মতো কাজ করে, তবে ইনডেক্সিং সুবিধা বেশি।

কাস্টম ইনডেক্স ব্যবহার করা যায়।

বিভিন্ন ধরনের অপারেশন সহজেই করা যায়।

DataFrame হলো একাধিক Series-এর সমন্বয়ে তৈরি একটি টেবিলের মতো (2D) ডাটা স্ট্রাকচার। এটি একাধিক কলাম ও সারি ধারণ করতে পারে।

DataFrame-এর বৈশিষ্ট্যঃ

এটি একাধিক কলাম এবং সারি নিয়ে তৈরি হয়।

প্রতিটি কলাম এক ধরনের ডাটা রাখতে পারে (যেমন সংখ্যা, স্ট্রিং, বা মিশ্র ডাটা)।

CSV, Excel, SQL ইত্যাদি ফাইল থেকে সহজেই ডাটা লোড করা যায়।

In [1]:
# pandas install
!pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.12/site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd;
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# Create series from dictionary

data1={'a':1,'b':2,'c':3}
pd.Series(data1)

a    1
b    2
c    3
dtype: int64

In [4]:
data3=[10,20,30]
index=['A','B','C']
pd.Series(index,data3)

10    A
20    B
30    C
dtype: object

In [5]:
# Dataframe 
data4={
    'Name':['A','B','C','D','E'],
    'Age':['34','40','50','60','70'],
    'City':['Texas','Chicago','Florida','Chennai','Pune']
}

pd.DataFrame(data4)

  Name Age     City
0    A  34    Texas
1    B  40  Chicago
2    C  50  Florida
3    D  60  Chennai
4    E  70     Pune

In [6]:
# Dataframe 
data4=[
    {'Name':'A','Age':'30','City':'Chennai'},
     {'Name':'B','Age':'30','City':'Floriad'},
      {'Name':'C','Age':'30','City':'Pune'},
       {'Name':'D','Age':'30','City':'Luxemberg'},
]

pd.DataFrame(data4)

  Name Age       City
0    A  30    Chennai
1    B  30    Floriad
2    C  30       Pune
3    D  30  Luxemberg

In [7]:
# read data from csv file
data6=pd.read_csv('sample_data.csv')
print(data6)

   ID Name  Age     City
0   1    A   25  Florida
1   2    S   30  Chicago
2   3    K   22  Chennai
3   4    N   28     Pune
4   5    R   35  Bangkok

In [8]:
data6.head(2) # top 2 data

   ID Name  Age     City
0   1    A   25  Florida
1   2    S   30  Chicago

In [9]:
data6.tail(2) # last 2 data

   ID Name  Age     City
3   4    N   28     Pune
4   5    R   35  Bangkok

In [10]:
data6.loc[2] # pick up row 2

ID            3
Name          K
Age          22
City    Chennai
Name: 2, dtype: object

In [11]:
data6.iloc[2]

ID            3
Name          K
Age          22
City    Chennai
Name: 2, dtype: object

In [12]:
# accessing a specified element

data6['Name']

0    A
1    S
2    K
3    N
4    R
Name: Name, dtype: object

In [13]:
# accessing a specified element

data6.at[1,'Name']

'S'

In [14]:
# data manipulation
# add salary column
data6['Salary']=["5000$","6000$","7000$","8000$","9000$"]
data6

   ID Name  Age     City Salary
0   1    A   25  Florida  5000$
1   2    S   30  Chicago  6000$
2   3    K   22  Chennai  7000$
3   4    N   28     Pune  8000$
4   5    R   35  Bangkok  9000$

In [15]:
# drop a column 
data6.drop('Salary',axis=1,inplace=True)
data6

   ID Name  Age     City
0   1    A   25  Florida
1   2    S   30  Chicago
2   3    K   22  Chennai
3   4    N   28     Pune
4   5    R   35  Bangkok

In [16]:
data6

   ID Name  Age     City
0   1    A   25  Florida
1   2    S   30  Chicago
2   3    K   22  Chennai
3   4    N   28     Pune
4   5    R   35  Bangkok

In [17]:
# increase the age of every column +1
data6['Age']=data6['Age']+1
data6

   ID Name  Age     City
0   1    A   26  Florida
1   2    S   31  Chicago
2   3    K   23  Chennai
3   4    N   29     Pune
4   5    R   36  Bangkok

In [18]:
# drop the last row 
data=[
    {'Name':'A','Age':'26','City':'Chicago'}
]

pd.DataFrame(data).drop(0,inplace=True)

In [19]:
# get statistical summary
data6.describe()

             ID        Age
count  5.000000   5.000000
mean   3.000000  29.000000
std    1.581139   4.949747
min    1.000000  23.000000
25%    2.000000  26.000000
50%    3.000000  29.000000
75%    4.000000  31.000000
max    5.000000  36.000000